// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

// const a = ['a', 'b', 'c'];
// const b = [1, 2, 3];
// const c = a.concat(b)
// console.log(c);

// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

//  const a = ['a', 'b', 'c'];
// a.push(1, 2, 3)
// console.log(a);

// 3) Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// const a = ['1', '2', '3'];
// const b = a.slice();
// b.push(4, 5, 6);
// // b.push(4, 5, 6);
// console.log(b);

// 4) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const b = [1, 2, 3];
// a = b.slice().reverse();
// b.push(4)
// console.log(a);
// console.log(b);

// 5) Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// const b = [1, 2, 3];
// b.push(4, 5, 6)
// console.log(b);

// 6) Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// const b = [1, 2, 3];
// b.unshift(4, 5, 6)
// console.log(b);

// 7)  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// const a = [`js`, `css`, `jq`];
// console.log(a[0]);

// :sunglasses: Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// const a = [`js`, `css`, `jq`];
// console.log(a[a.length -1]);

// 9) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

// const a = [1, 2, 3, 4, 5, 6];
// const b = a.slice(0,3);
// console.log(b);

// 10) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]. Скрыть решение.

// const a = [1, 2, 3, 4, 5, 6];
// const b = a.slice(3, a.length -1);
// console.log(b);

// 11) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// const a = [1, 2, 3, 4, 5, 6];
// const b = a.splice(1, 2);
// console.log(a);

// 12)  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. Показать решение.

// const a = [1, 2, 3, 4, 5, 6];
// const b = a.splice(1, 3);
// console.log(b);

// 13) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. Показать решение.

// const a = [1, 2, 3, 4, 5, 6];
// a.splice(2, 0, `a`, `b`, `c`);
// console.log(a);

// 14) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. Показать решение. (edited)

// const a = [1, 2, 3, 4, 5, 6];
// a.splice(1, 0, `a`, `b`);
// let b = a.indexOf(4)+1;
// a.splice(b, 0, `c`);
// let c = a.indexOf(5)+1;
// a.splice(c, 0, `e`);
// console.log(a);

// // 1) Вибираємо випадкове число (від 0 до довжини масива);
// // 2) Записати в змінну звернення типу масив[індекс];
// // 3) Вивести змінну з пунтку 2 в алерт;

// const b = [1,2,3,4,5,6,7]
// let a = Math.floor(Math.random()*b.length)
// console.log(a);

// let index = Math.floor(Math.random()*animals.length);
// alert(animals[index]);
// 1) Через prompt вводимо свій варіант тваринки
// 2) Варіант компютера записати в змінну
// 3) Порівнюємо наш варіант з копютерним
// 3,1) Якщо варіанти співпали тоді виводимо алертом що юзер виграва.
// 3,2) Якщо варіанти не співпали кажемо що користувач програв і виводимо варіант компютера.

// const a = [`лев`, `тигр`, `корова`];
// let index = Math.floor(Math.random()*a.length);
// console.log(a);
// console.log(index);
// let b = prompt(`Животное?`, `лев, тигр или корова`);
// if (b != null) {
//     b = b.toLocaleLowerCase();
// }
// let c = a.indexOf(b);
// if (index === c) {
//     alert(`СОВПАЛО`)
// } else {
//     alert(`Неповезло ;( правильный вариант был ${a[index]} `)
// }

// Написати гру Камінь Ножиці Папір.
// Варіанти вибору потрібно зберігати в масиві
// Користувач вводить свій варіант
// Компютер вибирає свій рандомний варівант з масиву
// Первіряємо вибір користувача і вибір компютера.
// Опрацювати всі варіанти:
// 1) Варіанти де виграє користувач
// 2) Варіанти де виграє компютер
// 3) Варіанти де виходить нічия.

// const mass = [`камень`, `ножницы`, `бумага`];
// let compChoice = Math.floor(Math.random() * mass.length);
// let userPromt = prompt(`Выберите камень, ножницы, бумагу`);
// let draw = `НИЧИЯ`;
// let userWin = `Ты победил`;
// let compWin = `Ты проиграл`;

// if (userPromt !== null) {
//   userPromt = userPromt.toLocaleLowerCase();
// }
// userChoice = mass.indexOf(userPromt);
// if (
//   (userChoice == 0 && compChoice == 0) ||
//   (userChoice == 1 && compChoice == 1) ||
//   (userChoice == 2 && compChoice == 2)
// ) {
//   alert(`${draw} Вы оба выбрали ${mass[userChoice]}`);
// }
// if (
//   (userChoice == 0 && compChoice == 2) ||
//   (userChoice == 1 && compChoice == 0) ||
//   (userChoice == 2 && compChoice == 1)
// ) {
//   alert(
//     `${compWin} Компьютер выбрал ${mass[compChoice]} , а ты ${mass[userChoice]}`
//   );
// }

// if (
//   (userChoice == 0 && compChoice == 1) ||
//   (userChoice == 1 && compChoice == 2) ||
//   (userChoice == 2 && compChoice == 0)
// ) {
//   alert(
//     `${userWin} Компьютер выбрал ${mass[compChoice]} , а ты ${mass[userChoice]}`
//   );
// }

// 1) Записуємо в змінну строку з промта
// 2) Зробити строку масивом
// 3) Скопіювати масив
// 4) Реверсимо масив
// 5) З масивів робимо строки
// 6) Порівнюємо дві строки і виводимо результат в консоль;

// let userPromt = prompt(`Введите лорем`);
// const mass = userPromt.split(' ');
// console.log(mass);
// let massReverse = mass.slice().reverse();
// console.log(massReverse);
// massReverse = massReverse.join(` `)

// console.log(`Было ${userPromt}`);
// console.log(`cтало ${massReverse}`);

// 1) Запитати логін
// 2) Перевірити чи існує логін в базі
// 3) Якщо логін існує вивести алерт ("Такий логін вже існує")
// 4) Якщо логін не існує вивести алерт ("Вітаємо")

// let logins = ["rew", "qwewwe", "apple", "js", "row", "col"];
// let userPromt = prompt(`Введите логин`);
// console.log(userPromt);
// if (userPromt == null) {
//   alert(`ВАМ НАДО БЫЛО ВВЕСТИ ЛОГИН!!!`);
// } else {
//   userPromt = logins.includes(userPromt);
//   if (userPromt) {
//     alert(`Такий логін вже існує`);
//   } else {
//     alert(`Вітаємо`);
//   }
// }

// HW
/*
  Написать следующий скрипт:
  
    - При загрузке страницы пользователю предлагается ввести через prompt число. 
      Число введенное пользователем записывается в массив чисел.
      
    - Операция ввода числа пользователем и сохранение в массив продолжается до
      тех пор, пока пользователь не нажмет Cancel в prompt. Используйте цикл do...while.
      
    - После того как пользователь прекратил ввод нажав Cancel, необходимо взять 
      массив введенных чисел, сложить общую сумму всех элементов массива и 
      записать ее в переменную. Используйте цикл for или for...of.
      
    - По окончанию ввода, если массив не пустой, вывести alert с текстом `Общая сумма чисел равна ${сумма}`
      
  🔔 PS: Делать проверку того, что пользователь ввел именно число, а не произвольный набор 
      символов, не обязательно. Если хотите, в случае некорректного ввода покажите alert с текстом 
      'Было введено не число, попробуйте еще раз', при этом результат prompt записывать 
      в массив чисел не нужно, после чего снова пользователю предлагается ввести число в prompt.
*/
let userInput = undefined;
const numbers = [];
let total = 0;
do {
  userInput = prompt(`Введите число`);

  if (userInput === null) {
    userInput = 0;
    for (i of numbers) {
      total += i;
    }
    if (total !== 0) {
      alert(`Общая сумма ${total}`);
    } else {
      alert(`Вы не ввели не одного числа;(`);
    }
  } else if (isNaN(Number(userInput))) {
    alert(`Это не число!`);
  } else if (Number(userInput) === 0) {
    alert(`Ну введи ты число`);
  } else {
    numbers.push(Number(userInput));
  }
} while (userInput !== 0);

/*
  ⚠️ ЗАДАНИЕ ПОВЫШЕННОЙ СЛОЖНОСТИ - ВЫПОЛНЯТЬ ПО ЖЕЛАНИЮ
  
  Напишите скрипт имитирующий авторизацию пользователя.
  
  Есть массив паролей зарегистрированных пользователей passwords. 
  
  При посещении страницы, необходимо попросить пользователя ввести свой пароль,
  после чего проверить содержит ли массив passwords пароль введенный пользователем.
  
  Пароль можно ввести не верно всего n раз, кол-во хранится в переменной attempts.
  Подсказка: используйте цикл do...while.
  Если был введен пароль который есть в массиве passwords, вывести alert 
  с текстом 'Добро пожаловать!' и прекратить спрашивать пароль в цикле.
  Если был введен не существующий пароль, отнять от лимита попыток единицу, 
  вывести alert с текстом "Неверный пароль, у вас осталось n попыток", 
  где n это оставшийся лимит. 
  
  После того как пользователь закрыл alert, запросить пароль снова. 
  Продолжать запрашивать пароль до тех пор, пока пользователь не введет 
  существующий пароль, не кончатся попытки или пока пользователь 
  не нажмет Cancel в prompt.
  Если закончились попытки, вывести alert с текстом "У вас закончились попытки, аккаунт заблокирован!"
  
  Если пользователь нажмет Cancel, прекратить выполнение цикла.
*/

const passwords = ["qwerty", "111qwe", "123123", "r4nd0mp4zzw0rd"];
let attempts = 3;
